app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "science"], ["room_number", 230], ["created_at", "2017-11-08 15:07:52.446494"], ["updated_at", "2017-11-08 15:07:52.446494"]]
---
  def create
    # @school_class = SchoolClass.new(params.require(:school_class))
    @school_class = SchoolClass.new(school_class_params(:title, :room_number))
    @school_class.save