app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params(:first_name, :last_name))
    # @student = Student.new(params.require(:student))
    # @student.first_name = params[:first_name]
    # @student.last_name = params[:last_name]
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Jamal"], ["last_name", "Idris"], ["created_at", "2017-12-03 21:52:13.717489"], ["updated_at", "2017-12-03 21:52:13.717489"]]

  def update
    @student = Student.find(params[:id])
    # @student.update(params.require(:student))
    @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-02-22 23:15:28.450678"], ["id", 1]]